{
    "architectures": [
        "Gemma3ForConditionalGeneration"
    ],
    "boi_token_index": 255999,
    "dtype": "float16",
    "eoi_token_index": 256000,
    "eos_token_id": [
        1,
        106
    ],
    "image_token_index": 262144,
    "initializer_range": 0.02,
    "mm_tokens_per_image": 256,
    "model_type": "gemma3",
    "text_config": {
        "_sliding_window_pattern": 6,
        "attention_bias": false,
        "attention_dropout": 0.0,
        "attn_logit_softcapping": null,
        "bos_token_id": 2,
        "dtype": "float16",
        "eos_token_id": 1,
        "final_logit_softcapping": null,
        "head_dim": 256,
        "hidden_activation": "gelu_pytorch_tanh",
        "hidden_size": 2560,
        "initializer_range": 0.02,
        "intermediate_size": 10240,
        "layer_types": [
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention"
        ],
        "max_position_embeddings": 131072,
        "model_type": "gemma3_text",
        "num_attention_heads": 8,
        "num_hidden_layers": 34,
        "num_key_value_heads": 4,
        "pad_token_id": 0,
        "query_pre_attn_scalar": 256,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "full_attention": {
                "factor": 8.0,
                "rope_theta": 1000000,
                "rope_type": "linear"
            },
            "sliding_attention": {
                "rope_theta": 10000,
                "rope_type": "default"
            }
        },
        "sliding_window": 1024,
        "tie_word_embeddings": true,
        "use_bidirectional_attention": false,
        "use_cache": true,
        "vocab_size": 262208
    },
    "tie_word_embeddings": true,
    "transformers_version": "5.0.0"
}